// Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя).
Console.WriteLine("Hello, World!");
